---
layout: post
title: Derinlemesine Windows Objects ve Handles (0x01)
date: 2023-03-12 00:18 +0300
categories: [Reverse Engineering, Windows]
tags: [reversing, windows, internal, object, handle]
---

![banner](/assets/img/2023-03-12-derinlemesine-windows-objects-ve-handles-0x01/banner.png)

# Objects ve Handles Bağlantısı

Windows nesneler kümesinden oluşan bir işletim sistemidir. Object, bir sistem kaynağını (resource) temsil eden bir data structure’dır. Uygulamalar, object data’larına veya bir object’in temsil ettiği sistem kaynağına doğrudan erişemez. Uygulamaların sistem kaynağını incelemek veya değiştirmek için kullanabileceği bir object handle edinmesi gerekir. Yani Bir process, object’i kullanmadan önce o object’in handle’ına sahip olmalıdır. Çünkü handle’lar (yalnızca) hedef object’lerin türünü/bellekteki adresini belirlemeye yardımcı olur.

Her handle'ın sistem tarafından tutulan bir tabloda bir girişi bulunur ve bu giriş handle'ın ilişkili olduğu objenin adresini, objenin türünü, handle'ın erişim haklarını ve diğer özelliklerini belirler. Bu tabloya "Object Table" denir ve Windows işletim sistemi tarafından yönetilir. Object Table, Windows işletim sistemi tarafından yönetilen bir veri yapısıdır ve normal kullanıcılar tarafından direk olarak görüntülenemez. Ancak, Windows API'leri veya benzer araçlar kullanarak, bu veri yapısındaki bilgilerin bir kısmına erişmek mümkün olabilir. Yazının başlarında fazla internal'e inmeden aşağıdaki gibi Object Table'ın structure'ı görüntülenebilir:

```cpp
lkd> dt nt!_HANDLE_TABLE
   +0x000 NextHandleNeedingPool : Uint4B
   +0x004 ExtraInfoPages   : Int4B
   +0x008 TableCode        : Uint8B
   +0x010 QuotaProcess     : Ptr64 _EPROCESS
   +0x018 HandleTableList  : _LIST_ENTRY
   +0x028 UniqueProcessId  : Uint4B
   +0x02c Flags            : Uint4B
   +0x02c StrictFIFO       : Pos 0, 1 Bit
   +0x02c EnableHandleExceptions : Pos 1, 1 Bit
   +0x02c Rundown          : Pos 2, 1 Bit
   +0x02c Duplicated       : Pos 3, 1 Bit
   +0x02c RaiseUMExceptionOnInvalidHandleClose : Pos 4, 1 Bit
   +0x030 HandleContentionEvent : _EX_PUSH_LOCK
   +0x038 HandleTableLock  : _EX_PUSH_LOCK
   +0x040 FreeLists        : [1] _HANDLE_TABLE_FREE_LIST
   +0x040 ActualEntry      : [32] UChar
   +0x060 DebugInfo        : Ptr64 _HANDLE_TRACE_DEBUG_INFO
lkd> ?? sizeof(nt!_HANDLE_TABLE)
unsigned int64 0x80
```

> Bu kaynaklar; sistem veya uygulama tarafından kullanılan bellek alanı, disk alanı, network bağlantıları vb. temsil eder. Örneğin, bir file objesi bellekteki bir dosya sistemine ait bir dosyayı temsil eder ve bu objeyi kullanan bir uygulamanın dosyaya erişebilmesini ve içeriğini okuyabilmesini veya değiştirebilmesini sağlar. 

## Neden Objects/Handles?

Sistem, iki ana nedenden dolayı sistem kaynaklarına erişimi düzenlemek için object’leri ve handle’ları kullanır:

1. Object’lerin kullanımı, Microsoft'un sistemi kolayca güncelleyebilmesini sağlar. Microsoft, Windows’un sonraki sürümlerini yayınladığında, güncellenen object’i çok az veya hiç ek çalışma olmadan yayınlamak.

2. Windows güvenliğinden yararlanmanızı sağlar. Her object’in kendi Access Control Lists’i (ACL) vardır. Bir uygulama object için her handle oluşturduğunda, sistem (Object Manager) object’in ACL'sini inceler. Ayrıca bir process, object üzerinde gerçekleştirebileceği eylemleri görmek için bu listeye bakar (process'lerin de object olduğunu unutmayalım).

Özet olarak objeler ve handle'lar, Windows işletim sistemi tarafından saklama, paylaşma, iletişim ve erişme işlemlerini kolaylaştırmak için kullanılır.

## Object Manager

Her obje bir header, bir body ve optional footer içerir. Tüm object’ler aynı struct’a sahip olduğundan, Windows'ta tüm objeleri koruyan tek bir Object Manager vardır. Object Manager sadece nesnenin başlığını yönetir ve body kısmı, nesne türüne göre bir Executive Sub-system tarafından yönetilir. Örneğin, bir file objesinin body kısmı, I/O Yöneticisi Executive Sub-system tarafından yönetilir. 

Aşağıda örnek olması açısından objenin header structure'ı görüntülenmiştir

```cpp
lkd> dt nt!_OBJECT_HEADER
   +0x000 PointerCount     : Int8B
   +0x008 HandleCount      : Int8B
   +0x008 NextToFree       : Ptr64 Void
   +0x010 Lock             : _EX_PUSH_LOCK
   +0x018 TypeIndex        : UChar
   +0x019 TraceFlags       : UChar
   +0x019 DbgRefTrace      : Pos 0, 1 Bit
   +0x019 DbgTracePermanent : Pos 1, 1 Bit
   +0x01a InfoMask         : UChar
   +0x01b Flags            : UChar
   +0x01b NewObject        : Pos 0, 1 Bit
   +0x01b KernelObject     : Pos 1, 1 Bit
   +0x01b KernelOnlyAccess : Pos 2, 1 Bit
   +0x01b ExclusiveObject  : Pos 3, 1 Bit
   +0x01b PermanentObject  : Pos 4, 1 Bit
   +0x01b DefaultSecurityQuota : Pos 5, 1 Bit
   +0x01b SingleHandleEntry : Pos 6, 1 Bit
   +0x01b DeletedInline    : Pos 7, 1 Bit
   +0x01c Reserved         : Uint4B
   +0x020 ObjectCreateInfo : Ptr64 _OBJECT_CREATE_INFORMATION
   +0x020 QuotaBlockCharged : Ptr64 Void
   +0x028 SecurityDescriptor : Ptr64 Void
   +0x030 Body             : _QUAD
```

Windows kernel’ı, kullanıcı modu process’leri tarafından kullanılmak üzere çeşitli nesne türleri tasarlanmıştır. Bu objelerin data structur’ları kernel space’te saklanır. Object Manager (internal adı “Ob”) windows kaynaklarını yöneten windows subsystem’idir. Kaynakları temsil eden tüm objelerin bir Object Type özelliği ve kaynakla ilgili diğer meta data’ları vardır. Tüm objeleri görmek için sysinternals paketindeki WinObj.exe aracını inceleyin.

> Object Manager direk olarak görülemez. Object Manager, Windows işletim sistemi tarafından yürütülen bir sistem yapı parçasıdır ve kullanıcılar tarafından doğrudan erişilemez.

## Bellek Yönetimi ve Performansı

Handle’lar ve object’ler sadece bellek parçalarıdır ve belleği tüketirler. Bu nedenle, sistem performansını korumak için handle’lar kapatılmalı ve artık ihtiyaç duyulmayan object’ler silinmelidir. Bu yapılmazsa, disk belleği dosyasının aşırı kullanımı nedeniyle uygulamanız sistem performansına zarar verebilir. 

Bir process sona erdiğinde, sistem otomatik olarak handle’ları kapatır ve process tarafından oluşturulan objeleri bellekten siler. Fakat bir thread sona erdiğinde, sistem genellikle handle’ları kapatmaz veya object’leri silmez. Bunun haricinde, eğer belirtilen object'tin header'ındaki flag'lerinde `OB_FLAG_PERMANENT_OBJECT` belirtilmişse, handle sayısı 0'a düştüğünde bile obje yok edilemez. Bir objenin flag bölümünde hangi flag'in seçildiğini bulabilmek için:

```cpp
lkd> dt nt!_OBJECT_HEADER -a Flags ffffa78f3b54d050
   +0x01b Flags : 0x2 ''
```

0x2'nin anlamı ise KernelObject, internal adı OB_FLAG_KERNEL_OBJECT olarak bilinen bir bayrak set edilmiştir. Kısaca bu objenin yalnızca kernel handle'larına sahip olabileceğini belirler. İleri kısımlarda bu konu hakkında daha fazla bilgi verilecektir.

<u>Handle'lar dinamik olarak oluşturulabilir ve yok edilebilir, ancak bir objenin yok edilmesi handle'ın otomatik olarak yok edilmesine neden olmaz. Uygulamalar, handle'ları kapatmak zorundadır, çünkü process terminate edilene kadar destroy edilen objenin handle'ları hala bellekte map edilmiş durumundadır</u>.

## Handle Limitations

Bazı objeler aynı anda yalnızca bir handle’ı destekler. Diğer objeler, tek bir obje için birden çok handle’ı destekler. İşletim sistemi, objenin son handle’ı kapatıldıktan sonra objeyi bellekten otomatik olarak kaldırır. Neden kaldırır? Hatırlayalım; “Eğer bir objenin referans sayısı 0 olduğunda, Object Manager objeyi bellekten tamamen kaldırabilir, çünkü artık kullanılmayan bir objedir.”

Object structure'ından ileri kısımlarda bahsedilmiştir fakat şimdiden bu header'daki referans counter'dan bahsetmekte fayda var. Object header'da bir objedeki tüm referans sayısını tutan bölüme PointerCount denir. Bu bölüm aracılığıyla hangi nesnelerin kullanımda olduğunun kaydını tutar (buradaki referans: handle sayısıyla ilişkilidir).

> Her objenin bir referans sayıcı vardır ve her objeye erişen işlem, objenin referans sayısını bir arttırır. Eşzamanlı olarak, objeyi kullanmaktan vazgeçildiğinde, objenin referans sayısı bir azaltılır. Bu sistem, Windows işletim sistemi tarafından yönetilen objelerin bellek yönetimini düzenlemek için kullanılır. Bir objenin referans sayısı 0 olduğunda, Object Manager objeyi bellekten tamamen kaldırabilir, çünkü artık kullanılmayan bir objedir. Ayrıca şu bilgiyi de unutmayalım: “Bir process sona erdiğinde, sistem otomatik olarak handle’ları kapatır ve process tarafından oluşturulan objeleri bellekten siler.” Bu işlem güvenli bellek yönetimi içindir.

Aşağıda bir objenin yapısında referans sayısını tutan bölümü görebilirsiniz:

```cpp
lkd> dt nt!_OBJECT_HEADER -a PointerCount
   +0x000 PointerCount : Int8B
```

Bir objenin header adresini vermek gerekirse:

```cpp
lkd> dt nt!_OBJECT_HEADER ffffa78f39e40050 -a PointerCount
   +0x000 PointerCount : 0n261879
```

